In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Exploring all the datasets one by one

### page_topic.csv

In [21]:
df = pd.read_csv('../datadays2020/page_topic.csv')

In [22]:
df.head()

     pageId  topicId  confidence
0  10743259       37    0.497099
1  10743259       23    0.016994
2  10743259       10    0.371499
3  10743259        4    0.105349
4  10743258       33    0.245752

In [23]:
df.describe()

             pageId       topicId    confidence
count  2.811876e+07  2.811876e+07  2.811876e+07
mean   5.464478e+06  2.453257e+01  2.457692e-01
std    3.142089e+06  1.407157e+01  2.373932e-01
min    1.000000e+00  0.000000e+00  1.000002e-02
25%    2.679088e+06  1.100000e+01  6.562485e-02
50%    5.550003e+06  2.600000e+01  1.684998e-01
75%    8.245494e+06  3.500000e+01  3.451548e-01
max    1.074326e+07  4.900000e+01  9.998839e-01

In [29]:
print("""pageId is in range of {} to {} \n
topicId is in range of {} to {} \n
confidence is in range of {} to {} \n""".format(df['pageId'].unique()[-1] , df['pageId'].unique()[0] , 
                                              df['topicId'].unique()[-1] , df['topicId'].unique()[0] ,
                                                df['confidence'].unique()[-1] , df['confidence'].unique()[0]))

pageId is in range of 1 to 10743259

topicId is in range of 46 to 37

confidence is in range of 0.019242339 to 0.49709868

In [34]:
#check for nan values
print("There is {} nan values ".format("" if df.isna().values.any() else "No"))

There is No nan values

In [50]:
#find most frequent element
for e in df.columns:
    print("column {}".format(e))
    items_counts = df[e].value_counts()
    print("""top three most frequent elements are\n {}  \n 
          top three least frequent elements are\n {}  """.format(items_counts[:3] , items_counts[-3:]))
    print("--------------end of {}----------------".format(e))

column adId
top three most frequent elements are
 2047    1
6842    1
6870    1
Name: adId, dtype: int64

          top three least frequent elements are
 5448    1
3399    1
6147    1
Name: adId, dtype: int64
--------------end of adId----------------
column campaignId
top three most frequent elements are
 8343    211
5918    160
6850     48
Name: campaignId, dtype: int64

          top three least frequent elements are
 4207    1
2134    1
8194    1
Name: campaignId, dtype: int64
--------------end of campaignId----------------
column advertiserId
top three most frequent elements are
 8414    424
6578    181
2167    137
Name: advertiserId, dtype: int64

          top three least frequent elements are
 10494    1
2629     1
6394     1
Name: advertiserId, dtype: int64
--------------end of advertiserId----------------

### ad.csv

In [61]:
df = pd.read_csv('../datadays2020/ad.csv')

In [45]:
df.head()

   adId  campaignId  advertiserId
0  7867        5918          8414
1  7866        5918          8414
2  7865        5918          8414
3  7863        8343          8414
4  7862        8343          8414

In [46]:
df.describe()

              adId   campaignId  advertiserId
count  3256.000000  3256.000000   3256.000000
mean   5624.645577  4958.381757   5638.853194
std    1957.739025  2678.464798   2722.979337
min       6.000000    30.000000      1.000000
25%    5220.750000  2664.750000   3137.000000
50%    6150.500000  5095.000000   6572.000000
75%    6994.250000  7270.000000   8078.000000
max    7867.000000  9523.000000  10749.000000

In [62]:
print("""adId is in range of {} to {} \n
campaignId is in range of {} to {} \n
advertiseId is in range of {} to {} \n""".format(df['adId'].unique()[-1] , df['adId'].unique()[0] , 
                                              df['campaignId'].unique()[-1] , df['campaignId'].unique()[0] ,
                                                df['advertiserId'].unique()[-1] , df['advertiserId'].unique()[0]))

adId is in range of 6 to 7867

campaignId is in range of 9400 to 5918

advertiseId is in range of 5175 to 8414

In [34]:
#check for nan values
print("There is {} nan values ".format("" if df.isna().values.any() else "No"))

There is No nan values

In [49]:
#find most frequent element
for e in df.columns:
    print("column {}".format(e))
    items_counts = df[e].value_counts()
    print("""top three most frequent elements are\n {}  \n 
          top three least frequent elements are\n {}  """.format(items_counts[:3] , items_counts[-3:]))
    print("--------------end of {}----------------".format(e))

column adId
top three most frequent elements are
 2047    1
6842    1
6870    1
Name: adId, dtype: int64

          top three least frequent elements are
 5448    1
3399    1
6147    1
Name: adId, dtype: int64
--------------end of adId----------------
column campaignId
top three most frequent elements are
 8343    211
5918    160
6850     48
Name: campaignId, dtype: int64

          top three least frequent elements are
 4207    1
2134    1
8194    1
Name: campaignId, dtype: int64
--------------end of campaignId----------------
column advertiserId
top three most frequent elements are
 8414    424
6578    181
2167    137
Name: advertiserId, dtype: int64

          top three least frequent elements are
 10494    1
2629     1
6394     1
Name: advertiserId, dtype: int64
--------------end of advertiserId----------------

### ad_image.csv

In [63]:
df = pd.read_csv('../datadays2020/ad_image.csv')

In [52]:
df.head()

   adId                                      imageFeatures
0  7867  [0.0524589940905571, 0.0, 0.04262353479862213,...
1  7866  [0.0032160670962184668, 0.1444239318370819, 0....
2  7865  [0.027210379019379616, 0.0, 0.5133526921272278...
3  7863  [0.0013980235671624541, 0.0, 0.0, 0.0455568209...
4  7862  [0.02426762878894806, 0.026081759482622147, 0....

In [53]:
df.describe()

              adId
count  3256.000000
mean   5624.645577
std    1957.739025
min       6.000000
25%    5220.750000
50%    6150.500000
75%    6994.250000
max    7867.000000

In [59]:
print("adId is in range of {} to {} \n".format(df['adId'].unique()[-1] , df['adId'].unique()[0]))

adId is in range of 6 to 7867

In [64]:
#check for nan values
print("There is {} nan values ".format("" if df.isna().values.any() else "No"))

There is No nan values

In [65]:
# #find most frequent element
# items_counts = df['pageId'].value_counts()
# print("""top three most frequent elements are\n {}  \n 
#       top three least frequent elements are\n {}  """.format(items_counts[:3] , items_counts[-3:]))
#no useful information here because all the image features are unique

### ad_title.csv

In [67]:
df = pd.read_csv('../datadays2020/ad_title.csv')

In [68]:
df.head()

   adId  wordId
0     6      24
1     6      25
2     6      26
3     6      27
4     6      28

In [69]:
df.describe()

               adId        wordId
count  18122.000000  18122.000000
mean    5645.788048    729.095023
std     1951.536908    765.828747
min        6.000000      0.000000
25%     5270.000000    110.000000
50%     6167.000000    426.500000
75%     7000.000000   1131.750000
max     7867.000000   2683.000000

In [70]:
print("""adId is in range of {} to {} \n
wordId is in range of {} to {} \n""".format(df['adId'].unique()[-1] , df['adId'].unique()[0] , 
                                              df['wordId'].unique()[-1] , df['wordId'].unique()[0]))

adId is in range of 7867 to 6

wordId is in range of 1861 to 24

In [71]:
#check for nan values
print("There is {} nan values ".format("" if df.isna().values.any() else "No"))

There is No nan values

In [73]:
#find most frequent element
for e in df.columns:
    print("column {}".format(e))
    items_counts = df[e].value_counts()
    print("""top three most frequent elements are\n {}  \n 
          top three least frequent elements are\n {}  """.format(items_counts[:3] , items_counts[-3:]))
    print("--------------end of {}----------------".format(e))

column adId
top three most frequent elements are
 6854    11
6808    11
6864    11
Name: adId, dtype: int64

          top three least frequent elements are
 7716    1
6258    1
2423    1
Name: adId, dtype: int64
--------------end of adId----------------
column wordId
top three most frequent elements are
 57    567
11    552
13    345
Name: wordId, dtype: int64

          top three least frequent elements are
 290    1
568    1
701    1
Name: wordId, dtype: int64
--------------end of wordId----------------

### user_page_view.csv

In [74]:
df = pd.read_csv('../datadays2020/user_page_view.csv')

In [75]:
df.head()

    userId   pageId      timestamp
0   821961     8116  1579599211445
1    15321  9533442  1579599211443
2  1125090  9410379  1579599211440
3   407101  8616213  1579599211429
4   781615  9543366  1579599211429

In [76]:
df.describe()

             userId        pageId     timestamp
count  6.722982e+07  6.722982e+07  6.722982e+07
mean   1.082700e+06  5.381278e+06  1.579000e+12
std    7.593801e+05  3.353457e+06  3.399870e+08
min    8.000000e+00  3.000000e+00  1.578429e+12
25%    4.222600e+05  2.285483e+06  1.578721e+12
50%    9.607940e+05  6.775661e+06  1.578984e+12
75%    1.700401e+06  7.989253e+06  1.579313e+12
max    2.688642e+06  9.571037e+06  1.579599e+12

In [77]:
print("""userId is in range of {} to {} \n
pageId is in range of {} to {} \n
timestamp is in range of {} to {} \n""".format(df['userId'].unique()[-1] , df['userId'].unique()[0] , 
                                              df['pageId'].unique()[-1] , df['pageId'].unique()[0] ,
                                                df['timestamp'].unique()[-1] , df['timestamp'].unique()[0]))

userId is in range of 2688641 to 821961

pageId is in range of 1168421 to 8116

timestamp is in range of 1578429000015 to 1579599211445

In [78]:
#check for nan values
print("There is {} nan values ".format("" if df.isna().values.any() else "No"))

There is No nan values

In [79]:
#find most frequent element
for e in df.columns:
    print("column {}".format(e))
    items_counts = df[e].value_counts()
    print("""top three most frequent elements are\n {}  \n 
          top three least frequent elements are\n {}  """.format(items_counts[:3] , items_counts[-3:]))
    print("--------------end of {}----------------".format(e))

column userId
top three most frequent elements are
 202684     58500
1649918    19176
377814     18474
Name: userId, dtype: int64

          top three least frequent elements are
 1903751    1
2603689    1
1868327    1
Name: userId, dtype: int64
--------------end of userId----------------
column pageId
top three most frequent elements are
 2285483    3594743
8116       3009369
197         984285
Name: pageId, dtype: int64

          top three least frequent elements are
 6904046    1
172216     1
2419791    1
Name: pageId, dtype: int64
--------------end of pageId----------------
column timestamp
top three most frequent elements are
 1579018362000    13
1579328847449     9
1579345629671     9
Name: timestamp, dtype: int64

          top three least frequent elements are
 1578718595803    1
1579187336306    1
1579432652982    1
Name: timestamp, dtype: int64
--------------end of timestamp----------------

### event.csv

In [81]:
df = pd.read_csv('../datadays2020/event.csv')

In [82]:
df.head()

   displayId      timestamp   pageId  widgetId   userId  device  OS  browser
0    4706262  1578429005696  3543873      6262  2688642       0   0        0
1    4706267  1578429007726  6245475       607  2688641       1   3        0
2    4706260  1578429012060  4416499     11458  2688638       0   0        1
3    4706255  1578429017218  6246028      9358  1962852       0   0        0
4    4706256  1578429021388  5327047      9358  2687719       0   0        0

In [83]:
df.describe()

,displayId,timestamp,pageId,widgetId,userId,device,OS,browser
count,1.083071e+06,1.083071e+06,1.083071e+06,1.083071e+06,1.083071e+06,1.083071e+06,1.083071e+06,1.083071e+06
mean,2.517466e+06,1.579188e+12,5.311521e+06,7.464358e+03,1.239831e+06,2.737623e-01,3.605101e-01,1.117450e+00
std,1.313295e+06,4.583947e+08,3.725029e+06,4.394785e+03,7.914076e+05,4.541610e-01,6.267258e-01,2.539904e+00
min,1.516500e+05,1.578429e+12,4.000000e+00,9.000000e+00,8.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,1.328586e+06,1.578799e+12,4.120830e+05,3.582000e+03,5.335820e+05,0.000000e+00,0.000000e+00,0.000000e+00
50%,2.579519e+06,1.579161e+12,6.627877e+06,7.711000e+03,1.172044e+06,0.000000e+00,0.000000e+00,0.000000e+00
75%,3.661700e+06,1.579599e+12,8.463374e+06,1.157100e+04,1.938347e+06,1.000000e+00,1.000000e+00,1.000000e+00
max,4.706267e+06,1.579984e+12,1.056114e+07,1.436600e+04,2.688642e+06,3.000000e+00,7.000000e+00,1.020000e+02

In [84]:
print("""displayId is in range of {} to {} \n
timestamp is in range of {} to {} \n
pageId is in range of {} to {} \n
widgetId is in range of {} to {} \n
userId is in range of {} to {} \n
device is in range of {} to {} \n
OS is in range of {} to {} \n
browser is in range of {} to {} \n""".format(df['displayId'].unique()[-1] , df['displayId'].unique()[0] , 
                                              df['timestamp'].unique()[-1] , df['timestamp'].unique()[0] ,
                                                df['pageId'].unique()[-1] , df['pageId'].unique()[0],
                                            df['widgetId'].unique()[-1] , df['widgetId'].unique()[0],
                                            df['userId'].unique()[-1] , df['userId'].unique()[0],
                                            df['device'].unique()[-1] , df['device'].unique()[0],
                                            df['OS'].unique()[-1] , df['OS'].unique()[0],
                                            df['browser'].unique()[-1] , df['browser'].unique()[0]))

displayId is in range of 243751 to 4706262

timestamp is in range of 1579984161010 to 1578429005696

pageId is in range of 104462 to 3543873

widgetId is in range of 9448 to 6262

userId is in range of 22 to 2688642

device is in range of 3 to 0

OS is in range of 7 to 0

browser is in range of 54 to 0

In [85]:
#check for nan values
print("There is {} nan values ".format("" if df.isna().values.any() else "No"))

There is No nan values

In [86]:
#find most frequent element
for e in df.columns:
    print("column {}".format(e))
    items_counts = df[e].value_counts()
    print("""top three most frequent elements are\n {}  \n 
          top three least frequent elements are\n {}  """.format(items_counts[:3] , items_counts[-3:]))
    print("--------------end of {}----------------".format(e))

column displayId
top three most frequent elements are
 4198398    1
3172184    1
3227507    1
Name: displayId, dtype: int64

          top three least frequent elements are
 2224788    1
4311699    1
4194304    1
Name: displayId, dtype: int64
--------------end of displayId----------------
column timestamp
top three most frequent elements are
 1579718344271    69
1579719861875    55
1579580613909    42
Name: timestamp, dtype: int64

          top three least frequent elements are
 1578550473864    1
1579510306515    1
1579336968428    1
Name: timestamp, dtype: int64
--------------end of timestamp----------------
column pageId
top three most frequent elements are
 8116       20023
2285483    17862
205         9588
Name: pageId, dtype: int64

          top three least frequent elements are
 5131344    1
9333844    1
166570     1
Name: pageId, dtype: int64
--------------end of pageId----------------
column widgetId
top three most frequent elements are
 7759     45631
13728    31234
607      28570
Name: widgetId, dtype: int64

          top three least frequent elements are
 9402     1
11020    1
8409     1
Name: widgetId, dtype: int64
--------------end of widgetId----------------
column userId
top three most frequent elements are
 26033     323
163374    289
8409      279
Name: userId, dtype: int64

          top three least frequent elements are
 2581094    1
2587237    1
2097152    1
Name: userId, dtype: int64
--------------end of userId----------------
column device
top three most frequent elements are
 0    790425
1    288962
2      3510
Name: device, dtype: int64

          top three least frequent elements are
 1    288962
2      3510
3       174
Name: device, dtype: int64
--------------end of device----------------
column OS
top three most frequent elements are
 0    755570
1    280068
2     38343
Name: OS, dtype: int64

          top three least frequent elements are
 4    1137
6     195
7       1
Name: OS, dtype: int64
--------------end of OS----------------
column browser
top three most frequent elements are
 0    751600
1    115003
4    104810
Name: browser, dtype: int64

          top three least frequent elements are
 95    1
97    1
79    1
Name: browser, dtype: int64
--------------end of browser----------------

### click_train.csv

In [87]:
df = pd.read_csv('../datadays2020/click_train.csv')

In [88]:
df.head()

   displayId  adId  clicked
0    1210227  7182        0
1    1210227  7125        0
2    1210227  7181        0
3    1210227   535        0
4    1210227  7174        1

In [89]:
df.describe()

          displayId          adId       clicked
count  3.642244e+06  3.642244e+06  3.642244e+06
mean   3.105835e+06  3.853480e+03  2.230227e-01
std    9.807950e+05  2.465609e+03  4.162735e-01
min    1.210227e+06  6.000000e+00  0.000000e+00
25%    2.246184e+06  6.810000e+02  0.000000e+00
50%    3.162424e+06  5.049000e+03  0.000000e+00
75%    3.913442e+06  5.890000e+03  0.000000e+00
max    4.706267e+06  7.182000e+03  1.000000e+00

In [90]:
print("""displayId is in range of {} to {} \n
adId is in range of {} to {} \n
clicked is in range of {} to {} \n""".format(df['displayId'].unique()[-1] , df['displayId'].unique()[0] , 
                                              df['adId'].unique()[-1] , df['adId'].unique()[0] ,
                                                df['clicked'].unique()[-1] , df['clicked'].unique()[0]))

displayId is in range of 4706267 to 1210227

adId is in range of 5434 to 7182

clicked is in range of 1 to 0

In [91]:
#check for nan values
print("There is {} nan values ".format("" if df.isna().values.any() else "No"))

There is No nan values

In [92]:
#find most frequent element
for e in df.columns:
    print("column {}".format(e))
    items_counts = df[e].value_counts()
    print("""top three most frequent elements are\n {}  \n 
          top three least frequent elements are\n {}  """.format(items_counts[:3] , items_counts[-3:]))
    print("--------------end of {}----------------".format(e))

column displayId
top three most frequent elements are
 3771253    24
3773290    23
1987676    16
Name: displayId, dtype: int64

          top three least frequent elements are
 3584017    2
1882770    2
3800813    2
Name: displayId, dtype: int64
--------------end of displayId----------------
column adId
top three most frequent elements are
 17      67562
5486    49444
535     46456
Name: adId, dtype: int64

          top three least frequent elements are
 6452    1
6451    1
5269    1
Name: adId, dtype: int64
--------------end of adId----------------
column clicked
top three most frequent elements are
 0    2829941
1     812303
Name: clicked, dtype: int64

          top three least frequent elements are
 0    2829941
1     812303
Name: clicked, dtype: int64
--------------end of clicked----------------